#!/usr/bin/env python
# -*- coding: utf-8 -*-
# @Author: Hollay.Yan
# @Date:   2014-10-09 19:53:17
# @Last Modified by:   hollay
# @Last Modified time: 2014-10-11 17:30:13

L10N_MESSAGES = {
    'unauthorized': u'''非常抱歉，该二维码未被授权''',
    'inactive': u'''非常抱歉，该二维码未激活''',
    'welcome': u'''欢迎您使用物语，您可以\n
        1. 输入一段文字(200字以内)\n
        2. 拍摄一张照片(最多6张)\n
        3. 录制一段语音''',
    'used': u'''非常抱歉，该二维码已经被使用。请使用微信“扫一扫”扫描查看。''',
    'rollback': u'''已撤销上一步操作。''',
    'step': u'''%s保存成功！您还可以输入%s。\n
        撤销本次操作请回复0，完成输入请回复1''',
    'step_nomore': u'''保存成功！\n撤销本次操作请回复0，完成输入请回复1''',
    'step_text': u'''1段文字 ''',
    'step_img': u'''%d张图片''',
    'step_voice': u'''1段语音''',
    'menu': u'''操作步骤：\n
    	1. 扫描礼品二维码/输入礼品码\n
    	2. 根据提示，依次输入1-3条语音/图片/视频消息\n
    	3. 回复0撤销当前输入的消息\n
    	4. 回复1确认完成输入\n
    	5. 回复?打印帮助信息''',
    'busy': u'''您正在编辑另一个二维码，请完成后再编辑新的二维码''',
    'texttoolong': u'''您输入的文字太长啦！''',
    'textalreadyset': u'''您已经输入过文字啦！''',
    'imagealreadyset': u'''您已经输入6张照片，不能再多啦！''',
    'voicealreadyset': u'''您已经输入过语音消息，不能再多啦！''',
    'success': u'''恭喜，您已经完成了全部步骤，现在你可以把你的礼物送出去啦！''',
}
