#!/usr/bin/env python
# -*- coding: utf-8 -*-
# @Author: Hollay.Yan
# @Date:   2014-10-09 19:53:17
# @Last Modified by:   Hollay.Yan
# @Last Modified time: 2014-10-15 14:44:30

L10N_MESSAGES = {
    'unauthorized': u'''非常抱歉，该二维码未被授权''',
    'inactive': u'''非常抱歉，该二维码未激活''',
    'welcome': u'''欢迎您使用码上说，您可以\n输入一段文字(200字以内)\n拍摄一组照片(最多6张，建议每次发送1张照片)\n录制一段语音(最长60秒)''',
    'used': u'''非常抱歉，该二维码已经被使用。请使用微信“扫一扫”扫描查看。''',
    'rollback': u'''已撤销上一步操作，您可以继续输入其它内容。''',
    'step': u'''%s保存成功！您还可以上传%s。\n撤销本次操作请回复0，完成所有输入请回复1，清空所有输入请回复9''',
    'step_nomore': u'''%s内容保存成功！\n撤销本次操作请回复0，完成所有输入请回复1，清空所有输入请回复9''',
    'step_text': u'''1段文字 ''',
    'step_img': u'''%d张图片''',
    'step_voice': u'''1段语音''',
    'menu': u'''操作步骤：\n1. 扫描二维码/输入二维码内容串\n2. 根据提示输入文字、图片、语音消息，图片建议逐张上传。\n3. 回复0撤销最后一步输入的内容。\n4. 回复1确认完成所有输入\n5. 回复9清空所有输入内容。\n6. 回复?打印帮助信息''',
    'busy': u'''您正在编辑另一个二维码，请完成后再编辑新的二维码''',
    'texttoolong': u'''您输入的文字太长啦！''',
    'textalreadyset': u'''您已经输入过文字啦！''',
    'imagealreadyset': u'''您已经输入6张照片，不能再多啦！''',
    'voicealreadyset': u'''您已经输入过语音消息，不能再多啦！''',
    'success': u'''恭喜，您已经完成了全部步骤，现在你可以把你的二维码送出去啦！''',
}
