#!/usr/bin/env python
# -*- coding: utf-8 -*-
# @Author: Hollay.Yan
# @Date:   2014-10-09 19:53:17
# @Last Modified by:   Hollay.Yan
# @Last Modified time: 2014-10-09 20:34:30

L10N_MESSAGES = {
    'unauthorized': u'''非常抱歉，该二维码未被授权''',
    'inactive': u'''非常抱歉，该二维码未激活''',
    'welcome': u'''欢迎您使用码云，您可以\n
        1. 拍摄一张照片\n
        2. 录制一段视频\n
        3. 录制一段语音''',
    'used': u'''非常抱歉，该二维码已经被使用。请使用微信“扫一扫”扫描访问。''',
    'rollback': u'''已撤销上一步操作。''',
    'step': u'''保存成功！当前已输入%d条消息，您还可以继续输入%d条消息。\n
        撤销本次操作请回复0，完成输入请回复1''',
    'menu': u'''操作步骤：\n
    	1. 扫描礼品二维码/输入礼品码\n
    	2. 根据提示，依次输入1-3条语音/图片/视频消息\n
    	3. 回复0撤销当前输入的消息\n
    	4. 回复1确认完成输入\n
    	5. 回复?打印帮助信息''',
    'busy': u'''您正在编辑另一个二维码，请完成后再编辑新的二维码''',
    'success': u'''恭喜，您已经完成了全部步骤，现在你可以把你的礼物送出去啦！''',
}
